In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.Connection('data (3).sqlite')

In [2]:
q = """
SELECT lastName, firstName, officeCode
FROM employees
JOIN offices
    USING(officeCode)
WHERE country = "USA"
;"""

pd.read_sql(q, conn)

    lastName firstName  officeCode
0        Bow   Anthony           1
1   Firrelli      Jeff           1
2   Jennings    Leslie           1
3     Murphy     Diane           1
4  Patterson      Mary           1
5   Thompson    Leslie           1
6   Firrelli     Julie           2
7  Patterson     Steve           2
8      Tseng  Foon Yue           3
9     Vanauf    George           3

In [3]:
#Replacing the JOIN with a nested query

q = """
SELECT lastName, firstName, officeCode
FROM employees
WHERE officeCode IN (SELECT officeCode
                     FROM offices 
                     WHERE country = "USA")
;
"""
pd.read_sql(q, conn)

    lastName firstName  officeCode
0     Murphy     Diane           1
1  Patterson      Mary           1
2   Firrelli      Jeff           1
3        Bow   Anthony           1
4   Jennings    Leslie           1
5   Thompson    Leslie           1
6   Firrelli     Julie           2
7  Patterson     Steve           2
8      Tseng  Foon Yue           3
9     Vanauf    George           3

In [4]:
# No entiendo

q = """
SELECT lastName, firstName, officeCode
FROM employees
WHERE officeCode IN (
    SELECT officeCode 
    FROM offices 
    JOIN employees
        USING(officeCode)
    GROUP BY 1
    HAVING COUNT(employeeNumber) >= 5
)
;
"""
pd.read_sql(q, conn)

     lastName firstName  officeCode
0      Murphy     Diane           1
1   Patterson      Mary           1
2    Firrelli      Jeff           1
3      Bondur    Gerard           4
4         Bow   Anthony           1
5    Jennings    Leslie           1
6    Thompson    Leslie           1
7      Bondur      Loui           4
8   Hernandez    Gerard           4
9    Castillo    Pamela           4
10     Gerard    Martin           4

In [5]:
# Average per customer of the average of each payment
#Take all the payment orders for ONE customer and calculate the average,
# Then take all the average per customer and take the average again 

q = """
SELECT AVG(customerAvgPayment) AS averagePayment
FROM (
    SELECT AVG(amount) AS customerAvgPayment
    FROM payments
    JOIN customers
        USING(customerNumber)
    GROUP BY customerNumber
)
;"""
pd.read_sql(q, conn)

   averagePayment
0    31489.754582

In [8]:
# Foreign Key
#  Both Keys conneted have differnt names

q = """
SELECT lastName, firstName, employeeNumber
FROM employees
WHERE employeeNumber IN (SELECT salesRepEmployeeNumber
                     FROM customers 
                     WHERE country = "USA")
;
"""
pd.read_sql(q, conn)

    lastName firstName  employeeNumber
0   Jennings    Leslie            1165
1   Thompson    Leslie            1166
2   Firrelli     Julie            1188
3  Patterson     Steve            1216
4      Tseng  Foon Yue            1286
5     Vanauf    George            1323

Step 10
Having looked at the results from above, the product team is curious to dig into the underperforming products. They want to ask members of the team who have sold these products about what kind of messaging was successful in getting a customer to buy these specific products. Using a subquery or common table expression (CTE), select the employee number, first name, last name, city of the office, and the office code for employees who sold products that have been ordered by fewer than 20 customers.

Hint: Start with the subquery, find all the products that have been ordered by 19 or less customers, consider adapting one of your previous queries.

Selection deleted

In [9]:
# WRONG
# Replace None with your code
df_under_20 = pd.read_sql("""
                SELECT employeeNumber, firstName, lastName, o.city, officeCode, productName,
                    COUNT(DISTINCT customerNumber) AS num_customers                     
                FROM employees AS e
                JOIN offices o
                    USING(officeCode)
                JOIN customers AS c
                    ON employeeNumber = c.salesRepEmployeeNumber
                JOIN orders
                    USING(customerNumber)    
                JOIN orderdetails
                    USING(orderNumber)
                JOIN products AS p
                    USING(productCode)   
                GROUP BY e.employeeNumber, e.firstName, e.lastName, o.city, o.officeCode, p.productName                               
                HAVING num_customers < 20
;""", conn)

df_under_20

,employeeNumber,firstName,lastName,city,officeCode,productName,num_customers
0,1165,Leslie,Jennings,San Francisco,1,18th Century Vintage Horse Carriage,4
1,1165,Leslie,Jennings,San Francisco,1,18th century schooner,2
2,1165,Leslie,Jennings,San Francisco,1,1900s Vintage Bi-Plane,1
3,1165,Leslie,Jennings,San Francisco,1,1900s Vintage Tri-Plane,2
4,1165,Leslie,Jennings,San Francisco,1,1903 Ford Model A,1
...,...,...,...,...,...,...,...
1363,1702,Martin,Gerard,Paris,4,The Mayflower,1
1364,1702,Martin,Gerard,Paris,4,The Queen Mary,2
1365,1702,Martin,Gerard,Paris,4,The Schooner Bluenose,2
1366,1702,Martin,Gerard,Paris,4,The Titanic,2
1367,1702,Martin,Gerard,Paris,4,The USS Constitution Ship,2

In [10]:
# Right

pd.read_sql("""
    SELECT 
        e.employeeNumber, 
        e.firstName, 
        e.lastName, 
        o.city, 
        o.officeCode, 
        p.productName,
        COUNT(DISTINCT c.customerNumber) AS num_customers
    FROM employees AS e
    JOIN offices o ON e.officeCode = o.officeCode
    JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
    JOIN orders ord ON c.customerNumber = ord.customerNumber
    JOIN orderdetails od ON ord.orderNumber = od.orderNumber
    JOIN products p ON od.productCode = p.productCode
    WHERE p.productCode IN (
        SELECT od2.productCode
        FROM orderdetails od2
        JOIN orders o2 ON od2.orderNumber = o2.orderNumber
        JOIN customers c2 ON o2.customerNumber = c2.customerNumber
        GROUP BY od2.productCode
        HAVING COUNT(DISTINCT c2.customerNumber) < 20
    )
    GROUP BY 
        e.employeeNumber, 
        e.firstName, 
        e.lastName, 
        o.city, 
        o.officeCode, 
        p.productName
    ORDER BY e.employeeNumber;
""", conn)

,employeeNumber,firstName,lastName,city,officeCode,productName,num_customers
0,1165,Leslie,Jennings,San Francisco,1,1949 Jaguar XK 120,2
1,1165,Leslie,Jennings,San Francisco,1,1952 Citroen-15CV,2
2,1165,Leslie,Jennings,San Francisco,1,1958 Chevy Corvette Limited Edition,2
3,1165,Leslie,Jennings,San Francisco,1,1969 Chevrolet Camaro Z28,2
4,1165,Leslie,Jennings,San Francisco,1,2002 Chevy Corvette,2
5,1166,Leslie,Thompson,San Francisco,1,1949 Jaguar XK 120,1
6,1166,Leslie,Thompson,San Francisco,1,1952 Citroen-15CV,1
7,1166,Leslie,Thompson,San Francisco,1,1969 Chevrolet Camaro Z28,1
8,1166,Leslie,Thompson,San Francisco,1,2002 Chevy Corvette,2
9,1188,Julie,Firrelli,Boston,2,1958 Chevy Corvette Limited Edition,1
10,1216,Steve,Patterson,Boston,2,1949 Jaguar XK 120,2
11,1216,Steve,Patterson,Boston,2,1952 Citroen-15CV,1
12,1216,Steve,Patterson,Boston,2,1958 Chevy Corvette Limited Edition,2
13,1216,Steve,Patterson,Boston,2,1969 Chevrolet Camaro Z28,2
14,1216,Steve,Patterson,Boston,2,2002 Chevy Corvette,2
15,1286,Foon Yue,Tseng,NYC,3,1949 Jaguar XK 120,1
16,1286,Foon Yue,Tseng,NYC,3,1952 Citroen-15CV,1
17,1286,Foon Yue,Tseng,NYC,3,1958 Chevy Corvette Limited Edition,2
18,1286,Foon Yue,Tseng,NYC,3,1969 Chevrolet Camaro Z28,1
19,1286,Foon Yue,Tseng,NYC,3,2002 Chevy Corvette,1
20,1323,George,Vanauf,NYC,3,1949 Jaguar XK 120,1
21,1323,George,Vanauf,NYC,3,1958 Chevy Corvette Limited Edition,2
22,1323,George,Vanauf,NYC,3,1969 Chevrolet Camaro Z28,1
23,1323,George,Vanauf,NYC,3,2002 Chevy Corvette,1
24,1337,Loui,Bondur,Paris,4,1949 Jaguar XK 120,1
25,1337,Loui,Bondur,Paris,4,1952 Citroen-15CV,1
26,1337,Loui,Bondur,Paris,4,1958 Chevy Corvette Limited Edition,1
27,1337,Loui,Bondur,Paris,4,1969 Chevrolet Camaro Z28,1
28,1370,Gerard,Hernandez,Paris,4,1949 Jaguar XK 120,2
29,1370,Gerard,Hernandez,Paris,4,1952 Citroen-15CV,2
30,1370,Gerard,Hernandez,Paris,4,1958 Chevy Corvette Limited Edition,2
31,1370,Gerard,Hernandez,Paris,4,1969 Chevrolet Camaro Z28,2
32,1370,Gerard,Hernandez,Paris,4,2002 Chevy Corvette,2
33,1401,Pamela,Castillo,Paris,4,1949 Jaguar XK 120,1
34,1401,Pamela,Castillo,Paris,4,1952 Citroen-15CV,2
35,1401,Pamela,Castillo,Paris,4,1958 Chevy Corvette Limited Edition,1
36,1401,Pamela,Castillo,Paris,4,1969 Chevrolet Camaro Z28,1
37,1401,Pamela,Castillo,Paris,4,2002 Chevy Corvette,1
38,1501,Larry,Bott,London,7,1949 Jaguar XK 120,2
39,1501,Larry,Bott,London,7,1952 Citroen-15CV,3
40,1501,Larry,Bott,London,7,1958 Chevy Corvette Limited Edition,3
41,1501,Larry,Bott,London,7,1969 Chevrolet Camaro Z28,2
42,1501,Larry,Bott,London,7,2002 Chevy Corvette,1
43,1504,Barry,Jones,London,7,2002 Chevy Corvette,1
44,1611,Andy,Fixter,Sydney,6,1949 Jaguar XK 120,2
45,1611,Andy,Fixter,Sydney,6,1952 Citroen-15CV,2
46,1611,Andy,Fixter,Sydney,6,1969 Chevrolet Camaro Z28,2
47,1611,Andy,Fixter,Sydney,6,2002 Chevy Corvette,2
48,1612,Peter,Marsh,Sydney,6,1949 Jaguar XK 120,3
49,1612,Peter,Marsh,Sydney,6,1952 Citroen-15CV,3
50,1612,Peter,Marsh,Sydney,6,1958 Chevy Corvette Limited Edition,1
51,1612,Peter,Marsh,Sydney,6,1969 Chevrolet Camaro Z28,3
52,1612,Peter,Marsh,Sydney,6,2002 Chevy Corvette,3
53,1621,Mami,Nishi,Tokyo,5,1958 Chevy Corvette Limited Edition,1
54,1702,Martin,Gerard,Paris,4,1958 Chevy Corvette Limited Edition,1

In [11]:
pd.read_sql("""
    SELECT DISTINCT 
        e.employeeNumber,
        e.firstName,
        e.lastName,
        o.city,
        o.officeCode,
        p.productName,
        low_perf.num_customers
    FROM employees e
    JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
    JOIN orders ord ON c.customerNumber = ord.customerNumber
    JOIN orderdetails od ON ord.orderNumber = od.orderNumber
    JOIN products p ON od.productCode = p.productCode
    JOIN offices o ON e.officeCode = o.officeCode
    JOIN (
        SELECT 
            od2.productCode,
            COUNT(DISTINCT c2.customerNumber) AS num_customers
        FROM orderdetails od2
        JOIN orders o2 ON od2.orderNumber = o2.orderNumber
        JOIN customers c2 ON o2.customerNumber = c2.customerNumber
        GROUP BY od2.productCode
        HAVING COUNT(DISTINCT c2.customerNumber) < 20
    ) AS low_perf ON od.productCode = low_perf.productCode
    ORDER BY e.employeeNumber;
""", conn)

,employeeNumber,firstName,lastName,city,officeCode,productName,num_customers
0,1165,Leslie,Jennings,San Francisco,1,1949 Jaguar XK 120,18
1,1165,Leslie,Jennings,San Francisco,1,1958 Chevy Corvette Limited Edition,19
2,1165,Leslie,Jennings,San Francisco,1,1952 Citroen-15CV,18
3,1165,Leslie,Jennings,San Francisco,1,1969 Chevrolet Camaro Z28,18
4,1165,Leslie,Jennings,San Francisco,1,2002 Chevy Corvette,18
5,1166,Leslie,Thompson,San Francisco,1,1949 Jaguar XK 120,18
6,1166,Leslie,Thompson,San Francisco,1,1952 Citroen-15CV,18
7,1166,Leslie,Thompson,San Francisco,1,1969 Chevrolet Camaro Z28,18
8,1166,Leslie,Thompson,San Francisco,1,2002 Chevy Corvette,18
9,1188,Julie,Firrelli,Boston,2,1958 Chevy Corvette Limited Edition,19
10,1216,Steve,Patterson,Boston,2,1949 Jaguar XK 120,18
11,1216,Steve,Patterson,Boston,2,1958 Chevy Corvette Limited Edition,19
12,1216,Steve,Patterson,Boston,2,1952 Citroen-15CV,18
13,1216,Steve,Patterson,Boston,2,1969 Chevrolet Camaro Z28,18
14,1216,Steve,Patterson,Boston,2,2002 Chevy Corvette,18
15,1286,Foon Yue,Tseng,NYC,3,1949 Jaguar XK 120,18
16,1286,Foon Yue,Tseng,NYC,3,1958 Chevy Corvette Limited Edition,19
17,1286,Foon Yue,Tseng,NYC,3,1952 Citroen-15CV,18
18,1286,Foon Yue,Tseng,NYC,3,1969 Chevrolet Camaro Z28,18
19,1286,Foon Yue,Tseng,NYC,3,2002 Chevy Corvette,18
20,1323,George,Vanauf,NYC,3,1949 Jaguar XK 120,18
21,1323,George,Vanauf,NYC,3,1958 Chevy Corvette Limited Edition,19
22,1323,George,Vanauf,NYC,3,1969 Chevrolet Camaro Z28,18
23,1323,George,Vanauf,NYC,3,2002 Chevy Corvette,18
24,1337,Loui,Bondur,Paris,4,1949 Jaguar XK 120,18
25,1337,Loui,Bondur,Paris,4,1958 Chevy Corvette Limited Edition,19
26,1337,Loui,Bondur,Paris,4,1952 Citroen-15CV,18
27,1337,Loui,Bondur,Paris,4,1969 Chevrolet Camaro Z28,18
28,1370,Gerard,Hernandez,Paris,4,1949 Jaguar XK 120,18
29,1370,Gerard,Hernandez,Paris,4,1958 Chevy Corvette Limited Edition,19
30,1370,Gerard,Hernandez,Paris,4,1952 Citroen-15CV,18
31,1370,Gerard,Hernandez,Paris,4,1969 Chevrolet Camaro Z28,18
32,1370,Gerard,Hernandez,Paris,4,2002 Chevy Corvette,18
33,1401,Pamela,Castillo,Paris,4,1949 Jaguar XK 120,18
34,1401,Pamela,Castillo,Paris,4,1958 Chevy Corvette Limited Edition,19
35,1401,Pamela,Castillo,Paris,4,1952 Citroen-15CV,18
36,1401,Pamela,Castillo,Paris,4,1969 Chevrolet Camaro Z28,18
37,1401,Pamela,Castillo,Paris,4,2002 Chevy Corvette,18
38,1501,Larry,Bott,London,7,1949 Jaguar XK 120,18
39,1501,Larry,Bott,London,7,1958 Chevy Corvette Limited Edition,19
40,1501,Larry,Bott,London,7,1952 Citroen-15CV,18
41,1501,Larry,Bott,London,7,1969 Chevrolet Camaro Z28,18
42,1501,Larry,Bott,London,7,2002 Chevy Corvette,18
43,1504,Barry,Jones,London,7,2002 Chevy Corvette,18
44,1611,Andy,Fixter,Sydney,6,1949 Jaguar XK 120,18
45,1611,Andy,Fixter,Sydney,6,1952 Citroen-15CV,18
46,1611,Andy,Fixter,Sydney,6,1969 Chevrolet Camaro Z28,18
47,1611,Andy,Fixter,Sydney,6,2002 Chevy Corvette,18
48,1612,Peter,Marsh,Sydney,6,1949 Jaguar XK 120,18
49,1612,Peter,Marsh,Sydney,6,1958 Chevy Corvette Limited Edition,19
50,1612,Peter,Marsh,Sydney,6,1952 Citroen-15CV,18
51,1612,Peter,Marsh,Sydney,6,1969 Chevrolet Camaro Z28,18
52,1612,Peter,Marsh,Sydney,6,2002 Chevy Corvette,18
53,1621,Mami,Nishi,Tokyo,5,1958 Chevy Corvette Limited Edition,19
54,1702,Martin,Gerard,Paris,4,1958 Chevy Corvette Limited Edition,19